<?php

namespace Database\Seeders;

use App\Models\Blog;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BlogSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $blog = new Blog();
        $blog->naslov = "САОПШТЕЊЕ УПРАВЕ РАЧУНАРСКОГ ФАКУЛТЕТА";
        $blog->sadrzaj = "Ситуација у којој се Рачунарски факултет тренутно налази је да 40ак студената неовлашћено борави у делу просторија Факултета у приватном власништву и онемогућава да осталих преко хиљаду студената оствари своје право на образовање и запослени право на рад. Након насилног упада студената 6.3.2025. овој групи студената је дато неколико упозорења да напусте просторије како би избегли дисциплинске поступке, а позив да то учине остао је отворен и до данас. Међутим, они су, уместо напуштања просторија, изабрали да спроведу процес застрашивања управе који се састоји од хајке преко друштвених мрежа и појединих медија, организовања скупова испред Факултета на које су позивани студенти са других факултета и грађани (што тумачимо да немају подршку студената Рачунарског факултета), претње путем имејла и телефоном, па чак и лепљење узнемирујућих плаката на адреси становања чланова управе.";
        $blog->save();

        Blog::create([
            "naslov" => "„БУДУЋНОСТ IТ-ЈА У ДОБА ВЕШТАЧКЕ ИНТЕЛИГЕНЦИЈЕ",
            "sadrzaj" => "Закључци дискусије Будућност IТ-ја у доба вештачке интелигенције:

            Вештачка интелигенција никада неће моћи да замени инжењера. Оно што људи замишљају јесте да ће од АI-ја добити чист код који ће моћи да ради у свим околностима, али то заправо није случај. Вештачка интелигенција је добра у усмеравању и давању идеја, али финалну верзију и финалну обраду мора да уради човек. Превелика су очекивања од АI-ја, али на многим примерима видимо да се одустаје од идеје да AI може да замени програмере. АI ће остати алат који ће кориситити програмери за много брже проналажење патерна и образаца за решавање проблема. Важно је свима приближити да је вештачка интелигенција алат и да је он другачији када га користи програмер у односу на онога који то није. Што веће знање има онај који користи тај алат то ће тај алат бити моћнији.
            АI ће доћи као технологија која ће се користити и то је неспорно, али је питање како ћемо ми кориситити ту технологију, као и све претходне инвације које су се појавиле. Оно што данас раде програмери неће радити и за 10 година, али остају фундаментални предмети као што су математика и алгоритми и то никада неће нестати. Рачунарски факултет је у одличној позицији јер је место где студенти могу да постану експерти за разумевање и даље развијање вештачке интелигенције, с обзиром на то да има дугу традицију бављења машинским учењем и АI-јем и писања истраживачких радова на ту тему, чак и пре масовније распростањености ове области у ја вности. Важно је младим људима предочити да јесте криза IТ-ја у току, али да је тренутно највећи раст запошљавања у области истраживања и бављења вештаком интелигенцијом. Млади треба да знају да је Рачунарски факултет ту да им покаже како се дубински и ваљано ради у овој области.",
        ]);

        Blog::create([
            "naslov" => "TX SERVICES ДОДЕЛИО НОВЧАНЕ НАГРАДЕ САРАДНИЦИМА У НАСТАВИ",
            "sadrzaj" => "Компанија TX Services доделила је новчане награде сарадницима у настави Рачунарског факултета Николи Јовану Реџићу и Вукадину Лазаревићу. TX services већ другу годину заредом додељује новчане награде у узносу од по 1250 евра сарадницима у настави Рачунарског факултета чиме одржава развој наставног кадра. Рачунарском факултету је овај вид сарање изузетно значајан јер подстиче младе стручњаке да започну своју академску каријеру на Факултету, а такође и учвршћује спону са индустријом.

            Подршка фирми из индустрије јесте изузетно важна, најпре као потврда нашег доприноса струци. Ова награда је изузетно леп гест, али оно што ме радује још више од ње саме, јесте чињеница да интересовање фирми из индустрије за сарадњу и подршку факултету расте. Млади наставни кадар је поред академског, жељан и практичног искуства и управо зато сматрам да је сарадња факултета са фирмама из индустрије од огромног значаја за општи напредак, како факултета, тако и саме индустрије, истакао је Никола Јован Реџић.

            Сарадња факултета са индустријом је изузетно важна јер пружа прилику за практично усавршавање наставног кадра."
        ]);
    }
}
